<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7b84abc642929708ee4fbeefa982422f8fe760fc25be6276390af56c017a9e86","plan_job_ref":"Job Test actions using target and replace #436 at https://github.com/dflook/terraform-github-actions/actions/runs/12447005871","plan_out_hash":"c460632a90e1106a1007df601b836e183d615892d35553b6471df256b8e75710","plan_hash":"d6e245793a3a019667b7d2dee0d6e833354a53930b8f658bf28eadb889d14c66","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "gz4SKMncXq" -> (known after apply)
!~  foreach = "2lq8KDndWf" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #436](https://github.com/dflook/terraform-github-actions/actions/runs/12447005871)